"""
МОДУЛЬ 1
В модуле прописаны заготовки для 8 функций
Под каждой функцией есть описание как она должна работать
ниже есть примеры использования функции
Задание: реализовать код функции, чтобы он работал по описанию и примеры использования давали верный результат
"""


def simple_separator():
    """
    Функция создает красивый разделитель из 10-и звездочек (**********)
    :return: **********
    """
    return '*' * 10

print(simple_separator() == '**********')  # True



print(simple_separator() == '**********')  # True


def long_separator(count):
    """
    Функция создает разделитель из звездочек число которых можно регулировать параметром count
    :param count: количество звездочек
    :return: строка разделитель
    """
    return '*' * count


print(long_separator(3) == '***')  # True
print(long_separator(4) == '****')  # True


def separator(symbol, count):
    """
    Функция создает разделитель из любых символов любого количества
    :param symbol: символ разделителя
    :param count: количество повторений
    :return: строка разделитель
    """
    return symbol * count

print(separator('-', 10) == '----------')  # True
print(separator('#', 5) == '#####')  # True


def hello_world():
    """
    Функция печатает Hello World в формате:
    **********

    Hello World!

    ##########
    :return: None
    """
    print(simple_separator())
    print("\nHello World!\n")
    print(separator('#', 10))

hello_world()

def hello_who(who='World'):
    """
    Функция печатает приветствие в красивом формате
    **********

    Hello {who}!

    ##########
    :param who: кого мы приветствуем, по умолчанию World
    :return: None
    """
    print(simple_separator())
    print(f"\nHello {who}!\n")
    print(separator('#', 10))

hello_who()
hello_who('Max')
hello_who('Kate')



def pow_many(power, *args):
    """
    Функция складывает любое количество цифр и возводит результат в степень power
    :param power: степень
    :param args: любое количество цифр
    :return: результат вычисления
    """
    return sum(args) ** power

print(pow_many(1, 1, 2) == 3)  # True -> (1 + 2)**1 == 3
print(pow_many(1, 2, 3) == 5)  # True -> (2 + 3)**1 == 5
print(pow_many(2, 1, 1) == 4)  # True -> (1 + 1)**2 == 4
print(pow_many(3, 2) == 8)  # True -> 2**3 == 8
print(pow_many(2, 1, 2, 3, 4) == 100)  # True -> (1 + 2 + 3 + 4)**2 == 10**2 == 100


def print_key_val(**kwargs):
    """
    Функция выводит переданные параметры в виде key --> value
    :param kwargs: любое количество именованных параметров
    :return: None
    """
    for key, value in kwargs.items():
        print(f"{key} --> {value}")

print_key_val(name='Max', age=21)
print_key_val(animal='Cat', is_animal=True)



def my_filter(iterable, function):
    """
    Функция фильтрует последовательность iterable и возвращает новую
    Если function от элемента последовательности возвращает True, то элемент входит в новую последовательность иначе нет
    :param iterable: входная последовательность
    :param function: функция фильтрации
    :return: новая отфильтрованная последовательность
    """
    return [item for item in iterable if function(item)]

print(my_filter([1, 2, 3, 4, 5], lambda x: x > 3) == [4, 5])  # True
print(my_filter([1, 2, 3, 4, 5], lambda x: x == 2) == [2])  # True
print(my_filter([1, 2, 3, 4, 5], lambda x: x != 3) == [1, 2, 4, 5])  # True
print(my_filter(['a', 'b', 'c', 'd'], lambda x: x in 'abba') == ['a', 'b'])  # True